In [4]:
!pip install tabula-py

Requirement already satisfied: tabula-py in c:\users\user\anaconda3.4\lib\site-packages
Requirement already satisfied: pandas in c:\users\user\anaconda3.4\lib\site-packages (from tabula-py)
Requirement already satisfied: urllib3 in c:\users\user\anaconda3.4\lib\site-packages (from tabula-py)
Requirement already satisfied: distro in c:\users\user\anaconda3.4\lib\site-packages (from tabula-py)
Requirement already satisfied: numpy in c:\users\user\anaconda3.4\lib\site-packages (from tabula-py)
Requirement already satisfied: python-dateutil>=2 in c:\users\user\anaconda3.4\lib\site-packages (from pandas->tabula-py)
Requirement already satisfied: pytz>=2011k in c:\users\user\anaconda3.4\lib\site-packages (from pandas->tabula-py)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3.4\lib\site-packages (from python-dateutil>=2->pandas->tabula-py)

You are using pip version 9.0.1, however version 19.0.3 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [8]:
import tabula

In [9]:
from tabula import read_pdf

In [65]:
df=read_pdf("Baronsmead-copy.pdf",multiple_tables=True,encoding='ISO-8859-1', ouput_format='csv',stream=True,pages='all',
             pandas_options={'header':None}, area=[269.875, 12.75, 790.5, 300])

In [66]:
list_of_tables =[]
for table in df:
    list_of_tables.append(table)

In [67]:
len(list_of_tables)

3

In [68]:
list_of_tables[0]

                           0         1         2        3
0           Total net assets  £174.39m  £199.39m      NaN
1  Net asset value per share    81.19p    92.10p  (11.8)%
2                Share price    81.00p    87.75p   (7.7)%

In [69]:
list_of_tables[1]

                                0       1      2
0                       Cisiv Ltd  Oct 18    789
1              Rockfish Group Ltd  Dec 18    789
2                             NaN     NaN    NaN
3  Tribe Digital Holdings Pty Ltd  Dec 18    788
4        The Panoply Holdings plc  Nov 18    660
5        Access Intelligence plc  Oct 18     84
6               Total investments     NaN  3,110

In [70]:
list_of_tables[2]

                                              0           1       2      3
0                         Symphony Ventures Ltd      Nov 18   4,163    2.4
1  A r ms  t r o  n  g  Cr a v  e  n  L  t d  *  D  e  c1 8  7  4 0    1.0
2                              IP Solutions Ltd      Oct 18     165  0.4**
3                            Crawshaw Group plc      Oct 18       0    0.0
4                            Total realisations         NaN   5,068    NaN

In [84]:
df=read_pdf("Baronsmead-copy.pdf",multiple_tables=True,encoding='ISO-8859-1', ouput_format='csv',stream=True,pages='all',
            pandas_options={'header':None}, area=[200, 300, 790.5, 600])

In [85]:
len(df)

2

In [86]:
df[1]

                                  0    1    2
0              Unquoted investments   28   26
1                               AIM   41   45
2             Collective investment  NaN  NaN
3                          vehicles   30   29
4  Net current assets/(liabilities)    1    0
5                      Total Assets  100  100

In [87]:
df[0]

        0    1                       2     3
0       1    1             Ideagen plc   4.3
1       2    4              Happy Days   NaN
2     NaN  NaN         Consultancy Ltd   3.6
3       3    3           Bioventix plc   3.6
4       4    5  Carousel Logistics Ltd   3.4
5       5    7       Create Health Ltd   3.3
6       6    8        Pho Holdings Ltd   3.0
7       7    2             Netcall plc   2.5
8       8    6     Inspired Energy plc   2.4
9       9   16         Ten10 Group Ltd   2.3
10     10    9           Cerillion plc   2.2
11  Total  NaN                     NaN  30.6